Mynderse-Research-Lab/wt32-eth01-FreeRTOS/test/w5500_loopback/sdkconfig.defaults
# W5500 Loopback Test — sdkconfig.defaults
#
# Minimal ESP32 config; no Ethernet (no LAN8720 RMII), no MCP23S17.
# The W5500 is driven over SPI only.

CONFIG_IDF_TARGET="esp32"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=0
CONFIG_COMPILER_CXX_RTTI=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_HZ=1000

# No Ethernet (LAN8720 RMII disabled — using W5500 SPI instead)
CONFIG_ETH_USE_ESP32_EMAC=n
